Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType
Declares the panel schedule type.  The comments for each enum type show
a simple example of how the layout would look when applied to a panel schedule
Since:
2011

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.SeperatePhaseLoadsPerCircuit
| Ckt |  A  |  B  |  C  |
|  1  | 100 |  0  |  0  |
|  2  | 200 |  0  |  0  |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.TotalLoadOnlyPerCircuit
| Ckt |  Load  |
|  1  |  100   |
|  2  |  200   |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.LoadsByPhase
| Ckt |  A  |  B  |  C  | Ckt |
|  1  | 100 |  x  |  x  |     |
|     | 200 |  x  |  x  |  2  |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.LoadsByPhaseInSharedColumns
| Ckt |    A    |    B    |    C    | Ckt |
|  1  | 100/200 |    x    |    x    |  2  |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.MirroredPhaseColumns
| Ckt |  A  |  B  |  C  |  A  |  B  |  C  | Ckt |
|  1  | 100 |  x  |  x  | 200 |  x  |  x  |  2  |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.LoadsByPhaseInSplitColumns
| Ckt |     A     |     B     |     C     | Ckt |
|  1  | 100 | 200 |  x  |  x  |  x  |  x  |  2  |

Autodesk.Revit.DB.Electrical.PanelSchedulePhaseLoadType.NoLoadInformation
No load information